---
kind: property
id: P:Autodesk.Revit.DB.ColorOptions.SelectionColor
source: html/5681fc12-9555-6c29-6278-093184bde952.htm
---
# Autodesk.Revit.DB.ColorOptions.SelectionColor Property

The color of the current canvas theme used to highlight selected elements.

## Syntax (C#)
```csharp
public Color SelectionColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null